# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать
# программу, которая проверяет счастливость билета.

number = int(input('Введите шестизначный номер: '))
number2 = number // 1000
sum1 = 0
sum2 = 0

while number >= 1000:
    digit = (number % 10)
    sum1 = sum1 + digit
    number = number // 10

while number2 > 0:
    digit = (number2 % 10)
    sum2 = sum2 + digit
    number2 = number2 // 10

if sum1 == sum2:
    print("Это счастливое число!")
else:
    print("Это обычное число!")
